/* failure reason */
"Attempted to access NASR data before .load() weas called." = "Attempted to access NASR data before .load() weas called.";

/* failure reason */
"Bad response: %@." = "Bad response: %@.";

/* recovery suggestion */
"Call .load() before accessing NASR data." = "Call .load() before accessing NASR data.";

/* failure reason */
"Called .load() on a null distribution." = "Called .load() on a null distribution.";

/* failure reason */
"Continuation record references unknown FSS ‘%@’." = "Continuation record references unknown FSS ‘%@’.";

/* error description */
"Couldn’t download distribution." = "Couldn’t download distribution.";

/* failure reason */
"Couldn’t find file in archive with prefix “%@.”" = "Couldn’t find file in archive with prefix “%@.”";

/* failure reason */
"Couldn’t find file to load." = "Couldn’t find file to load.";

/* error description */
"Couldn’t load distribution." = "Couldn’t load distribution.";

/* error description */
"Couldn’t parse distribution data." = "Couldn’t parse distribution data.";

/* failure reason */
"Data is invalid." = "Data is invalid.";

/* recovery suggestion */
"Do not call .load() on a NullDistribution. Use NullDistribution for distributions that were previously loaded and serialized to disk." = "Do not call .load() on a NullDistribution. Use NullDistribution for distributions that were previously loaded and serialized to disk.";

/* failure reason */
"Invalid frequency ‘%@’." = "Invalid frequency ‘%@’.";

/* failure reason */
"No data was downloaded." = "No data was downloaded.";

/* failure reason */
"No such file in distribution: %@." = "No such file in distribution: %@.";

/* failure reason */
"Referenced undefined ARTCC record with ID ‘%@’." = "Referenced undefined ARTCC record with ID ‘%@’.";

/* failure reason */
"Referenced undefined frequency ‘%@’ for ARTCC %@." = "Referenced undefined frequency ‘%1$@’ for ARTCC %2$@.";

/* recovery suggestion */
"The NASR FADDS format may have changed, requiring an update to SwiftNASR." = "The NASR FADDS format may have changed, requiring an update to SwiftNASR.";

/* error description */
"This NASR has not been loaded yet." = "This NASR has not been loaded yet.";

/* failure reason */
"Unknown field ID ‘%@’ at ‘%@ %@’." = "Unknown field ID ‘%1$@’ at ‘%2$@ %3$@’.";

/* failure reason */
"Unknown field ID ‘%@’ for %@ kHz at ‘%@ %@’." = "Unknown field ID ‘%1$@’ for %2$@ kHz at ‘%3$@ %4$@’.";

/* failure reason */
"Unknown navaid ‘%@’." = "Unknown navaid ‘%@’.";

/* failure reason */
"Unknown pavement classification ‘%@’ for PCN." = "Unknown pavement classification ‘%@’ for PCN.";

/* failure reason */
"Unknown runway surface ‘%@’." = "Unknown runway surface ‘%@’.";

/* failure reason */
"Unknown VGSI identifier ‘%@’." = "Unknown VGSI identifier ‘%@’.";

/* recovery suggestion */
"Verify that the path to the distribution is correct." = "Verify that the path to the distribution is correct.";

/* recovery suggestion */
"Verify that the URL to the distribution is correct and accessible." = "Verify that the URL to the distribution is correct and accessible.";

